using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Controls;
using System.Windows.Data;
using System.Windows.Documents;
using System.Windows.Input;
using System.Windows.Media;
using System.Windows.Media.Imaging;
using System.Windows.Navigation;
using System.Windows.Shapes;

namespace WpfApp1
{
    /// <summary>
    /// Логика взаимодействия для MainWindow.xaml
    /// </summary>
    public partial class MainWindow : Window
    {
        public MainWindow()
        {
            InitializeComponent();
        }
        int a = 0;
        private void Click1(object sender, RoutedEventArgs e)
        {

            switch (a)
            {
                case 0:
                    //про Text1
                    Text1.Text = "Воин";
                    Text1.FontWeight = FontWeights.Normal;
                    //про Text2
                    Text2.Text = "Этого храброго бойца зовут Бродди. Года его жизни принято считать средними, не сложно догадаться, что за спиной у него множество кровавых сражений, и из всех он выходил победителем. Бродди предпочитает биться в одиночку и за спиной имеет крепкий щит. Поражает врагов безжалостный воин острой секирой, литой прочнейшей сталью. Так как секира неописуемо тяжела - воин ударяет реже других";
                    Text2.FontSize = 30;
                    Text2.Height = 280;
                    Text2.Width = 700;
                    Text2.HorizontalAlignment = HorizontalAlignment.Right;
                    //картинка
                    image.Visibility = Visibility.Visible;
                    //кнопка
                    button1.Content = "Далее";
                    a = 1;
                    break;
                case 1:
                    //про Text1
                    Text1.Text = "Характеристики воина";
                    //про Text2
                    Text2.Text = "Имя - Бродди\nЗдоровье - 200\nЗащита - 10\nУрон - 20\nШанс критического удара - 10% (1/10) + 2-4 урона\nСкорость атаки - медленная\nСпособность: Бродди впадает в ярость, отчего его удары становятся в два раза сильнее, а броня в два раза меньше (длительность - 2 хода) - тратит 4 энергии";
                    Text2.FontSize = 25;
                    a = 2;
                    break;
                case 2:
                    //про Text1
                    Text1.Text = "Маг";
                    //про Text2
                    Text2.Text = "Вайзар - это имя знают во всех уголках мира, ведь где бы он не появился, оставались лишь угли и запах гари. Этот маг хотя совсем ещё молод, но имеет он великую силу. Своим посохом, который Вайзар сам создал, будь ещё подростком, он способен подчинить целые города. Вайзар надевает слабую броню, потому что к нему не осмеливаются подойти достаточно близко";
                    Text2.FontSize = 35;
                    Text2.Width = 800;
                    //картинка
                    image.Visibility = Visibility.Hidden;
                    image1.Visibility = Visibility.Visible;
                    a = 3;
                    break;
                case 3:
                    //про Text1
                    Text1.Text = "Характеристики мага";
                    //про Text2
                    Text2.Text = "Имя - Вайзар\nЗдоровье - 240\nЗащита - 3\nУрон - 14\nШанс дополнительного урона от огненного снаряда - 30% (3/10) + 3 урона\nСкорость атаки - средняя\nСпособность: Вайзар накапливает свою мощь и выпускает во врага большой огненный снаряд, наносящий двойной урон и на  2 хода поджигающий противника - тратит 3 энергии";
                    Text2.FontSize = 25;
                    a = 4;
                    break;
                case 4:
                    //про Text1
                    Text1.Text = "Герой";
                    //про Text2
                    Text2.Text = "Герой - это спаситель многих народов, он очень храбр и благороден. Люди часто обращаются к нему за помощью, и он безвозмездно помогает. Никто не знает его настоящего имени, поэтому однажды его прозвали Маадыр, что и означает - герой. Маадыр защищен обычными доспехами. С виду Маадыр может показаться жестоким варваром, ведь его возраст и множество шрамов на лице заставляют ужаснуться, но на самом деле он хочет, чтоб все войны наконец закончились, и он смог отдохнуть";
                    Text2.FontSize = 28;
                    //картинка
                    image1.Visibility = Visibility.Hidden;
                    image2.Visibility = Visibility.Visible;
                    a = 5;
                    break;
                case 5:
                    //про Text1
                    Text1.Text = "Характеристики героя";
                    //про Text2
                    Text2.Text = "Имя - Маадыр\nЗдоровье - 170\nЗащита - 5\nУрон - 13\nШанс критического удара - 50% (1/2) + 1-2 урона\nСкорость атаки - быстрая\nСпособность: Маадыр предсказывает каким будет удар врага и делает уворот, полностью избегая получение урона от следующей атаки - тратит 4 энергии";
                    Text2.FontSize = 25;
                    a = 6;
                    break;
                case 6:
                    //про Text1
                    Text1.Text = "Выжившая";
                    //про Text2
                    Text2.Text = "Маленькая девочка, которая смогла выжить в окружении диких зверей. Она не способна в полной мере говорить на человеческом языке, но перед всеми представляется Найт. Она редко выходит на люди, только в случае желания вкусить человеческой плоти. В основном проводит время в лесу, охотясь на мелких зверей. Хоть и выросла в стае волков ей сложно сражаться голыми руками, поэтому пользуется заточенными копьями. Она не имеет брони, зато её здоровье необычно велико. Найт очень ловкая, поэтому труда может уклониться от атак";
                    //картинка
                    image2.Visibility = Visibility.Hidden;
                    image3.Visibility = Visibility.Visible;
                    a = 7;
                    break;
                case 7:
                    //про Text1
                    Text1.Text = "Характеристики выжившей";
                    //про Text2
                    Text2.Text = "Имя - Найт\nЗдоровье - 300\nЗащита - 0\nУрон - 15\nШанс снизить атаку противника вдвое - 10% (1/10)\nСкорость атаки - средняя\nСпособность: Найт взвывает, и на её зов приходит волчица, сражающаяся на стороне девочки. Волчица наносит 5 урона (действует 2 хода) - тратит 5 энергии";
                    a = 8;
                    break;
            }
        }
    }
}
